---
kind: property
id: P:Autodesk.Revit.DB.Curve.IsCyclic
zh: 曲线
source: html/b3a443d0-db6d-332b-62b4-41b534987608.htm
---
# Autodesk.Revit.DB.Curve.IsCyclic Property

**中文**: 曲线

The boolean value that indicates whether this curve is cyclic.

## Syntax (C#)
```csharp
public bool IsCyclic { get; }
```

## Returns
True if this curve is cyclic; otherwise, false.